app/controllers/admin/users_controller.rb

  def index
    respond_to do |format|
      @partial_file = "admin/users/index"
      format.html
      format.js {
        render :update do |page|
          page['left_col'].replace_html render_administration_sub_menu("index")
          page['middle_col'].replace_html :partial => "index"
          page['right_col'].replace_html render_right_col
        end
      }
      format.json {
          users = User.not_deleted.grid_data
          users.each { |u| u[:actions] = u.actions }
---
SELECT id,username,surname,name FROM `users` WHERE (`users`.`deleted` = 0)